console.log("Hdetailset.js");
// オブジェクトにした方がよさそう
let SHexpress=new Array(4);
SHexpress[0]=["大阪上本町","鶴橋","布施","河内国分","五位堂","大和高田","大和八木","桜井","以遠各駅","青山町","五十鈴川"];
SHexpress[1]=["各駅にとまります(急行)"];
SHexpress[2]=["大和八木までの各駅と","大和高田","五位堂","河内国分","布施","鶴橋"];
SHexpress[3]=["名古屋","蟹江","弥富","桑名","富田","四日市","塩浜","若松","白子","江戸橋","津","津新町","南が丘","久居","桃園",
"中川", "松阪", "伊勢市", "宇治山田", "五十鈴川", "朝熊", "池の浦", "鳥羽"];
let SHlimited=new Array(5);
SHlimited[0]=["大阪上本町","鶴橋","大和高田","大和八木","榛原","名張","青山町","中川","松阪","伊勢市","宇治山田","五十鈴川","鳥羽","志摩磯部","鵜方","賢島"];
SHlimited[1]=["大阪上本町","鶴橋","生駒","学園前","大和西大寺"];
SHlimited[2]=[];
SHlimited[3]=["名古屋", "桑名", "四日市", "白子" , "津","中川", "松阪", "伊勢市", "宇治山田", "五十鈴川", "鳥羽","志摩磯部","鵜方","賢島"];
SHlimited[4]=["名古屋", "桑名", "四日市", "白子" , "津","名張","大和八木","大和高田","鶴橋","大阪上本町"];
let SHrapid=new Array(5);
SHrapid[0]=["五位堂","大和高田","大和八木","桜井","榛原","室生口大野","赤目口","名張","桔梗が丘","美旗","青山町",
"温泉口","中川","松阪","伊勢市","宇治山田","五十鈴川","朝熊","池の浦","鳥羽"];
let Hsubexpress=["布施　八尾　高安　以遠各駅","各駅にとまります","高安までの各駅と　八尾　布施　鶴橋","蟹江　以遠各駅"];
let Hlimited=['大和高田　大和八木　榛原　名張　青山町　中川　松阪　伊勢市　宇治山田　五十鈴川　鳥羽　志摩磯部　鵜方','生駒　学園前　大和西大寺',
            '大和八木　大和高田　鶴橋'];
let Hrapid=["五位堂　大和高田　大和八木　榛原　室生口大野　赤目口　名張　桔梗が丘　美旗　青山町　温泉口　中川　松阪　伊勢市　宇治山田　五十鈴川　朝熊　池の浦",
           "各駅にとまります","桜井　大和八木　大和高田　五位堂　鶴橋"];
let Hlocal=new Array(4);
for(var i=0;i<4;i++){
    Hlocal[i]="各駅にとまります";
}
let Jrapid=new Array(3);
Jrapid[0]=["北新地","鶴橋までの各駅と","放出","住道","四条畷","星田","河内磐船","長尾","以遠各駅","京田辺","同志社前","木津"];
Jrapid[1]=["北新地","尼崎までの各駅と","伊丹","川西池田","中山寺","宝塚","西宮名塩","三田","新三田","以遠各駅","篠山口"];
let Jsubrapid=new Array(3);
Jsubrapid[0]=["北新地","鶴橋までの各駅と","放出","住道","四条畷","以遠各駅","松井山手","京田辺","同志社前","木津"];
Jsubrapid[1]=["北新地","尼崎までの各駅と","伊丹","川西池田","中山寺","宝塚","西宮名塩","三田","新三田","以遠各駅","篠山口"];
Jsubrapid[2]=["各駅にとまります"];
let staflag=0;
let express=SHexpress;
let subexpress=Hsubexpress;
let limited=SHlimited;
let rapid=Hrapid;
let local=Hlocal;
