console.log("Hdetailset.js");
// オブジェクトにした方がよさそう
var Jrapid;
var Jsubrapid;
var subsemiexpress=new Array(4);
let SHexpress=new Array(8);
SHexpress[0]=["大阪上本町","京橋","高砂","新中央","新越谷","せんげん台","新中島","以遠各駅","笠取","青山町","五十鈴川"];
SHexpress[1]=["各駅にとまります(急行)"];
SHexpress[2]=["新中島までの各駅と","せんげん台","新越谷","新中央","高砂","京橋"];
SHexpress[3]=["名古屋","蟹江","弥富","桑名","富田","四日市","塩浜","若松","白子","江戸橋","津","津新町","南が丘","久居","桃園",
"菊川", "松阪", "伊勢市", "宇治山田", "五十鈴川", "朝熊", "池の浦", "鳥羽"];
SHexpress[4]=["戎橋","今福","上本町","上松","竹ノ塚","中央","新中央","西大寺","空港第2ビル","空港"];
SHexpress[7]=["戎橋","今福","上本町","本町","古市","以遠各駅","長野"];
SHexpress[6]=["戎橋","今福","上本町","本町","古市","高島","高島神社","以遠各駅","吉野"];
let SHlimited=new Array(7);
SHlimited[0]=["大阪上本町","京橋","新越谷","新中島","榛原","名張","青山町","菊川","松阪","伊勢市","宇治山田","五十鈴川","鳥羽","志摩磯部","鵜方","賢島","名古"];
SHlimited[1]=["大阪上本町","京橋","新越谷","新中島","笠取","丸岡","筒井","河崎","水上","三谷","三谷公園","三谷温泉"];
SHlimited[2]=["大阪上本町","京橋","新越谷","新中島","榛原","名張","津","白子","四日市","桑名","名古屋"];
SHlimited[3]=["名古屋", "桑名", "四日市", "白子" , "津","菊川", "松阪", "伊勢市", "宇治山田", "五十鈴川", "鳥羽","志摩磯部","鵜方","賢島"];
SHlimited[4]=["名古屋", "桑名", "四日市", "白子" , "津","名張","新中島","新越谷","京橋","大阪上本町"];
SHlimited[5]=["戎橋","上本町","空港第2ビル","空港"];
SHlimited[6]=["戎橋","上本町","本町","古市","高島","高島神社","飛鳥","壺阪山","吉野口","福神","下市口","六田",'大和上市','吉野神宮','吉野'];
let SHrapid=new Array(5);
SHrapid[0]=["大阪上本町","京橋","新中央","新越谷","新中島","小海台","久喜","榛原","室生口大野","赤目口","名張","桔梗が丘","美旗","青山町",
"温泉口","菊川","松阪","伊勢市","宇治山田","五十鈴川","朝熊","池の浦","鳥羽"];
SHrapid[1]=["大阪上本町","京橋","新中央","新越谷","新中島","小海台","太平寺","桜井","笠取","深谷","丸岡","以遠各駅","潮本","河崎"];
SHrapid[2]=["空港","空港第2ビル","西大寺","新中央","中央","上本町","今福","戎橋","桜川","ドーム前","九条","西九条","尼崎","甲子園","西宮","魚崎","三宮"];
SHrapid[4]=["戎橋","今福","上本町","中央","新中央","西大寺","空港第2ビル","空港"];
let SHsubexpress=new Array(3);
SHsubexpress[0]=["大阪上本町","京橋","西新井","市川","高砂","以遠各駅","榛原","各駅にとまります"];
SHsubexpress[4]=["戎橋","今福","上本町","上松","東三条","竹ノ塚","以遠各駅","西大寺","各駅にとまります"];
let Hsubexpress=["西新井　市川　高砂　以遠各駅","各駅にとまります","高砂までの各駅と　市川　西新井　京橋","蟹江　以遠各駅","今福　上本町　上松　東三条　以遠各駅"];
let Hsubsemiexpress=['a','','各駅にとまります','','今福　上本町　上松　東三条　以遠各駅'];
let Hlimited=['新越谷　新中島　榛原　名張　青山町　菊川　松阪　伊勢市　宇治山田　五十鈴川　鳥羽　志摩磯部　鵜方','丸岡　筒井　河崎　水上　三谷　三谷公園',
            '新中島　新越谷　京橋'];
let Hrapid=["新中央　新越谷　新中島　小海台　久喜　榛原　室生口大野　赤目口　名張　桔梗が丘　美旗　青山町　温泉口　菊川　松阪　伊勢市　宇治山田　五十鈴川　朝熊　池の浦",
           "丸岡　以遠各駅","桜井　太平寺　小海台　新中島　新越谷　新中央　京橋","","今福　上本町　中央　新中央　西大寺　空港第2ビル"];
let Hlocal=new Array(10);
for(var i=0;i<10;i++){
    Hlocal[i]="各駅にとまります";
}
let staflag=0;
//路線によって分けたい
express=SHexpress;
if(station=='京橋駅'||station=='戎橋駅'){
    subexpress=SHsubexpress;
}else{
    subexpress=Hsubexpress;
}
subsemiexpress=Hsubsemiexpress;
limited=SHlimited;
rapid=SHrapid;
local=Hlocal;
var Kinobj = {//色は背景
    Typea: { type: "特急", color: red, detail: limited, },
    Typeb: { type: "快急", color: red, detail: rapid, },
    Typec: { type: "急行", color: orange, detail: express, },
    Typed: { type: "準急", color: green, detail: subexpress, },
    Typee: { type: "区準", color: green, detail: subsemiexpress, },
    Typef: { type: "普通", color: blue, detail: local, }
};
