var Ralimited = [['豊橋', '東岡崎', '知立', '神宮前', '金山', '名古屋', '国府宮', '名鉄一宮', '新木曽川', '笠松', '名鉄岐阜'],
['豊橋', '東岡崎', '知立', '神宮前', '金山', '名古屋', '岩倉', '江南', '柏森', '犬山', '犬山遊園', '新鵜沼']];
var Mlimited = [['豊橋', '国府', '新安城', '東岡崎', '知立', '神宮前', '金山', '名古屋','須ケ口', '国府宮', '名鉄一宮', '新木曽川', '笠松', '名鉄岐阜'],
['豊橋', '国府', '東岡崎', '新安城', '知立', '神宮前', '金山', '名古屋', '岩倉', '江南', '柏森', '犬山', '犬山遊園', '新鵜沼']];
var Mrapid;
var Mexpress = [['豊橋', '伊奈', '国府', '本宿', '美合', '東岡崎', '新安城', '知立', '前後', '鳴海', '堀田', '神宮前', '金山', '名古屋','栄生','須ヶ口','新清洲', '国府宮', '名鉄一宮', '新木曽川', '笠松', '名鉄岐阜'],
['豊橋', '伊奈', '国府', '本宿', '美合', '東岡崎', '新安城', '知立', '前後', '鳴海', '堀田', '神宮前', '金山', '名古屋','栄生','上小田井','西春', '岩倉','布袋', '江南', '柏森','扶桑', '犬山', '犬山遊園', '新鵜沼']];
var Msubexpress;
var Msubsemiexpress;
const Meiobj = {//色は背景
    Typea: { type: "快特", color: red, detail: Ralimited, },
    Typeb: { type: "特急", color: red, detail: Mlimited, },
    Typec: { type: "快急", color: red, detail: Mrapid, },
    Typed: { type: "急行", color: orange, detail: Mexpress, },
    Typee: { type: "準急", color: green, detail: Msubexpress, },
    Typelocal: { type: "普通", color: blue, detail: local, }
};
